Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 128)               106496    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 79)                10191     
=================================================================
Total params: 116,687
Trainable params: 116,687
Non-trainable params: 0
_________________________________________________________________
