Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 256)               318464    
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 54)                13878     
=================================================================
Total params: 332,342
Trainable params: 332,342
Non-trainable params: 0
_________________________________________________________________
