Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_2 (LSTM)                (None, 128)               86016     
_________________________________________________________________
dense_2 (Dense)              (None, 39)                5031      
=================================================================
Total params: 91,047
Trainable params: 91,047
Non-trainable params: 0
_________________________________________________________________
