Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               96256     
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 59)                7611      
=================================================================
Total params: 103,867
Trainable params: 103,867
Non-trainable params: 0
_________________________________________________________________
