Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               93184     
_________________________________________________________________
dense_1 (Dense)              (None, 53)                6837      
=================================================================
Total params: 100,021
Trainable params: 100,021
Non-trainable params: 0
_________________________________________________________________
