Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 256)               317440    
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 53)                13621     
=================================================================
Total params: 331,061
Trainable params: 331,061
Non-trainable params: 0
_________________________________________________________________
