Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 128)               93696     
_________________________________________________________________
dense_1 (Dense)              (None, 54)                6966      
=================================================================
Total params: 100,662
Trainable params: 100,662
Non-trainable params: 0
_________________________________________________________________
