Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_3 (LSTM)                (None, 128)               96256     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 59)                7611      
=================================================================
Total params: 103,867
Trainable params: 103,867
Non-trainable params: 0
_________________________________________________________________
