Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_14 (LSTM)               (None, 150)               108000    
_________________________________________________________________
dropout_12 (Dropout)         (None, 150)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 29)                4379      
=================================================================
Total params: 112,379
Trainable params: 112,379
Non-trainable params: 0
_________________________________________________________________
