Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_11 (LSTM)               (None, 40, 150)           108000    
_________________________________________________________________
dropout_9 (Dropout)          (None, 40, 150)           0         
_________________________________________________________________
dense_5 (Dense)              (None, 40, 29)            4379      
=================================================================
Total params: 112,379
Trainable params: 112,379
Non-trainable params: 0
_________________________________________________________________
