Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 40, 150)           108000    
_________________________________________________________________
dropout_1 (Dropout)          (None, 40, 150)           0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 150)               180600    
_________________________________________________________________
dropout_2 (Dropout)          (None, 150)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 29)                4379      
=================================================================
Total params: 292,979
Trainable params: 292,979
Non-trainable params: 0
_________________________________________________________________
